tap "hashicorp/tap"

brew "coreutils"
brew "curl"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "git"
brew "git-secrets"
brew "gh"
brew "ghq"
brew "neovim"
brew "lazygit"
brew "direnv"
brew "mise"
brew "pnpm"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "go-task"
brew "pre-commit"
brew "tree-sitter"
brew "azure-cli"
brew "postgresql@15"
brew "hashicorp/tap/terraform"
brew "jq"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "taplo"

cask "wezterm"
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"
cask "gcloud-cli"
cask "obsidian"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
