tap "hashicorp/tap"

brew "coreutils"
brew "curl"
brew "git"
brew "gh"
brew "neovim"
brew "lazygit"
brew "direnv"
brew "mise"
brew "pnpm"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "go-task"
brew "pre-commit"
brew "azure-cli"
brew "neonctl"
brew "postgresql@15"
brew "hashicorp/tap/terraform"
brew "jq"

cask "wezterm"
cask "visual-studio-code"
cask "google-chrome"
cask "docker-desktop"
cask "gcloud-cli"
cask "obsidian"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
